chcbaram/bluepad32/src/sdkconfig.defaults
#
# ESP32 options
#
CONFIG_COMPILER_OPTIMIZATION_PERF=y

CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

CONFIG_ESP32_XTAL_FREQ_AUTO=y

CONFIG_BT_ENABLED=y
CONFIG_BT_CONTROLLER_ONLY=y
CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY=y
# Should be, at least, one more than CONFIG_BLUEPAD32_MAX_DEVICES
# See: https://gitlab.com/ricardoquesada/bluepad32/-/issues/11
CONFIG_BTDM_CTRL_BR_EDR_MAX_ACL_CONN=5

CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y

#
# FreeRTOS
#
# Enable FreeRTOS stats formatting functions, needed for 'tasks' console command
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=y

#
# Bluepad32 options
#
CONFIG_BLUEPAD32_MAX_DEVICES=4
# Only one can be selected.
#CONFIG_BLUEPAD32_PLATFORM_AIRLIFT=y
#CONFIG_BLUEPAD32_PLATFORM_ARDUINO=y
#CONFIG_BLUEPAD32_PLATFORM_MIGHTYMIGGY=y
#CONFIG_BLUEPAD32_PLATFORM_NINA=y
#CONFIG_BLUEPAD32_PLATFORM_UNIJOYSTICLE=y
CONFIG_BLUEPAD32_PLATFORM_ESP32=y

#
# Add here other options
#
# Needed for NINA platform
CONFIG_SPI_FLASH_USE_LEGACY_IMPL=y
CONFIG_IDF_TARGET="esp32"
CONFIG_ESP32_DEFAULT_CPU_FREQ_240=y
CONFIG_FREERTOS_HZ=1000


